package com.animal.farm.infrastructure.foundation.web;



/**
 * @author zhangws 2020/04/28
 */
public enum MessageCode implements ErrorCode {
  /**
   * MessageCode定义
   */

  INFO_200(200, "成功"),
  ERROR_400(400, "参数有误"),
  ERROR_401(401, "无权操作"),
  ERROR_410(410, "服务间内部调用出错，请联系平台维护人员"),

  ERROR_500(500, "系统出现异常，请联系平台维护人员"),

  // 参数校验Code定义：1000 ~ 1099
  ERROR_1001(1001, "%s不能为空"),
  ERROR_1002(1002, "%s的值只能为[%s]"),
  ERROR_1003(1003, "%s的长度不能超过[%s]"),
  ERROR_1004(1004, "%s[%s]无效"),
  ERROR_1005(1005, "%s不能大于%s[%s，%s]"),
  ERROR_1006(1006, "%s不能重复"),
  ERROR_1007(1007, "%s必须是正整数"),
  ERROR_1008(1008, "%s必须大于%s"),
  ERROR_1009(1009, "%s必须大于等于%s"),
  ERROR_1010(1010, "%s格式不正确[%s]"),
  ERROR_1011(1011, "上游文件不得同时为下游文件"),
  ERROR_1012(1012, "流程间存在循环依赖，请检查流程依赖节点配置"),

  // 共通业务Code定义：1100 ~ 1199
  ERROR_1100(1100, "%s[%s]已经存在"),
  ERROR_1101(1101, "%s[%s]不存在"),
  ERROR_1102(1102, "%s[%s]不能重复"),
  ERROR_1103(1103, "结束时间不能小于开始时间"),
  ERROR_1104(1104, "%s[%s]不支持"),
  ERROR_1105(1105, "%s[%s]已被使用,无法删除"),
  ERROR_1106(1106, "%s[%s]是%s，无法%s"),
  ERROR_1107(1107, "执行%s[%s]失败：%s"),
  ERROR_1108(1108, "%s[%s]存在%s，无法删除"),
  ERROR_1109(1109, "%s不存在"),
  ERROR_1110(1110, "登录已过期，请重新登录"),
  ERROR_1111(1111, "%s[%s]已被使用，无法编辑"),
  ERROR_1112(1112, "%s[%s]已发生改变，不能直接使用"),
  ERROR_1113(1113, "流程依赖节点中有前置流程被删除了，请重新配置后上线"),
  ERROR_1114(1114, "创建加密key失败，请检查kms服务是否正常"),
  ERROR_1116(1116, "当前存储引擎不支持加密配置"),
  ERROR_1117(1117, "加密类型不支持[%s],可选加密类型: %s"),

  // federation-metadata：1200 ~ 1299
  ERROR_1200(1200, "集群[%s]已强制绑定命名空间，无法创建数据表"),
  ERROR_1201(1201, "分区字段必须是string类型"),
  ERROR_1202(1202, "集群创建数据表[%s]失败：%s"),
  ERROR_1203(1203, "无权%s数据表[%s]的%s"),
  ERROR_1204(1204, "数据表必须含有非分区字段"),
  ERROR_1205(1205, "此操作将删除数据表[%s]的数据，是否继续？"),
  ERROR_1206(1206, "获取数据表[%s]的存储信息失败"),
  ERROR_1207(1207, "判断数据表[%s]是否存在数据失败[%s]"),
  ERROR_1208(1208, "%s[%s]不属于当前工作空间，请重新选择"),
  ERROR_1209(1209, "请选择标签%s"),
  ERROR_1210(1210, "标签已经关联资源，%s失败"),
  ERROR_1211(1211, "集群创建数据视图[%s]失败：%s"),
  ERROR_1212(1212, "集群删除数据视图[%s]失败：%s"),
  ERROR_1213(1213, "预览的文档不存在"),
  ERROR_1214(1214, "上传的文档无法解析，请检查文件"),
  ERROR_1215(1215, "数据表[%s]存在保护标签[%s]，禁止aksk查询"),
  ERROR_1216(1216, "构建数据表导入导出配置失败：%s"),
  ERROR_1217(1217, "数据表[%s]已经损坏无法使用，请先恢复"),

  // federation-gateway: 1300 ~ 1399
  ERROR_1300(1300, "SQL执行错误:%s"),

  // security-authorization-service 1400 ~ 1499
  ERROR_1400(1400, "没有查看权限"),
  ERROR_1401(1401, "没有创建权限"),
  ERROR_1402(1402, "没有编辑权限"),
  ERROR_1403(1403, "没有删除权限"),

  ERROR_1410(1410, "角色[%s]已分配权限"),
  ERROR_1411(1411, "角色[%s]已关联用户"),
  ERROR_1412(1412, "权限校验服务尚未初始化，请稍后再试"),
  ERROR_1413(1413, "资源已经分配权限，请勿重复分配"),
  ERROR_1414(1414, "没有该资源权限，请检查参数"),
  ERROR_1415(1415, "调用应用中台接口失败[%s]%s"),
  ERROR_1416(1416, "没有需要保存的角色，请重新选择"),
  ERROR_1417(1417, "对资源类别[%s]的资源[%s]没有[%s]的权限"),
  ERROR_1418(1418, "没有需要授权的资源，请重新选择"),
  ERROR_1419(1419, "该角色已拥有表的全部权限，请在功能授权模块修改"),
  ERROR_1420(1420, "%s[%s]已被冻结"),
  ERROR_1421(1421, "用户[%s]不是工作空间[%s]下的用户"),
  ERROR_1422(1422, "工作空间[%s]已存在空间管理员[%s]，是否将管理员替换为[%s]？"),
  ERROR_1423(1423, "用户[%s]已经是工作空间[%s]的管理员"),
  ERROR_1424(1424, "系统默认角色[%s]无法%s"),
  ERROR_1425(1425, "%s[%s]已于[%s]过期"),
  ERROR_1426(1426, "该角色已拥有菜单的全部权限"),
  ERROR_1427(1427, "没有该角色的访问权限"),
  ERROR_1428(1428, "只有租户管理员和对应的空间管理员才可%s%s"),
  ERROR_1429(1429, "用户[%s]已存在资源类型[%s]的资源[%s]关于[%s]的权限"),
  ERROR_1430(1430, "密码必须包含大写字母、小写字母、数字和特殊字符，且长度不少于8位"),
  ERROR_1431(1431, "租户管理员%s%s时，必须指定工作空间ID"),
  ERROR_1432(1432, "上级组织不能是自己及下级组织"),
  ERROR_1433(1433, "该组织无法再上移"),
  ERROR_1434(1434, "该组织无法再下移"),
  ERROR_1435(1435, "该组织存在下级组织，无法删除"),
  ERROR_1436(1436, "该组织存在用户，无法删除"),
  ERROR_1437(1437, "组织[%s]下不存在用户[%s]"),
  ERROR_1438(1438, "该组织是数据表的提供方，无法删除"),
  ERROR_1439(1439, "该用户是数据表的责任人，无法删除"),
  ERROR_1440(1440, "用户[%s]没有所属组织，无法登录"),
  ERROR_1441(1441, "用户[%s]属于多个组织[%s]，无法登录"),
  ERROR_1442(1442, "当前系统使用的是第三方系统的用户，无法%s"),
  ERROR_1443(1443, "当前系统使用的是内置用户，无法%s"),
  ERROR_1444(1444, "用户所属命名空间[%s]，用户组织[%s]所属命名空间[%s],所属命名空间不同,无法登录"),
  ERROR_1445(1445, "变更空间管理员请使用租户管理员"),
  ERROR_1446(1446, "%s[%s]无效，原因:%s"),
  ERROR_1447(1447, "登录失败超过限制次数，账号已被锁定，请于[%s]后重新登录"),
  ERROR_1448(1448, "账号或密码错误，再输错[%s]次该账号将被锁定%s!"),
  ERROR_1449(1449, "结果上报异常，重试[%s]次后仍然无法上报"),
  ERROR_1450(1450, "AKSK所属系统已存在[%s]，不允许更改"),
  ERROR_1451(1451, "当前操作将%s，是否确认？"),
  ERROR_1452(1452, "新旧密码不可相同"),
  ERROR_1453(1453, "%s请稍后再试"),
  ERROR_1455(1455, "库表导入获取表记录数失败: "),
  ERROR_1456(1456, "取消失败，只可取消本用户的申请"),
  ERROR_1457(1457, "该账号已在其它设备登录"),
  //
//  // quality-scheduling
//  ERROR_2000(2000, "结束时间必须是未来时间，且结束时间[%s]与当前时间间[%s]的间隔不能小于%s秒"),
//  ERROR_2001(2001, "开始时间[%s]与结束时间[%s]间的间隔不能小于%s秒"),
//  ERROR_2002(2002, "计划模式是定时调度时，定时调度表达式[%s]不能为空"),
//  ERROR_2003(2003, "已过期或已删除的计划，无法手动触发[planId=%s, status=%s]"),
////  ERROR_2004(2004, "计划不支持手动触发执行"),
//  ERROR_2005(2005, "分发任务到Quality-Coordinator失败[planId=%s, taskId=%s, error=%s]"),
//  ERROR_2006(2006, "获取Quality-Coordinator的任务执行结果超时[planId=%s, instanceId=%s, timeout=%s分]"),
//  ERROR_2007(2007, "无法获取Quality-Coordinator的任务执行结果[planId=%s, instanceId=%s]"),
//  ERROR_2008(2008, "只有进行中的计划才能暂停[id=%s, status=%s]"),
//  ERROR_2009(2009, "只有暂停中的计划才能恢复为进行中[id=%s, status=%s]"),
//  ERROR_2010(2010, "运行中的规则计划不能删除[id=%s]"),
//  ERROR_2011(2011, "计划[id=%s, oldStatus=%s]不能转换到该状态[newStatus=%s]"),
//  ERROR_2012(2012, "超时时间如果设置，则只能是0或大于等于%s"),
//  ERROR_2013(2013, "配置的调度[%s]在有效期[%s ~ %s]内，无有效的触发时间"),
//
//  // quality-rule
//  ERROR_2100(2100, "创建[%s]规则失败[表=%s，字段=%s]"),
//  ERROR_2101(2101, "数据表状态异常[表=%s]"),
//  ERROR_2102(2102, "数据表未发布[表=%s]"),
//  ERROR_2103(2103, "业务时间[%s]不能是未来时间"),
//  ERROR_2104(2104, "%s类型的期望值必须是%s类型，而且范围为[%s, %s]"),
//  ERROR_2105(2105, "分区表达式[%s]已被规则关联，无法删除"),
//  ERROR_2106(2106, "%s类型的期望值需要在小数位%s位以内"),
//
  ERROR_2607(2607, "数据源连接失败"),
  ERROR_2608(2608, "数据源链接信息有误"),
  ERROR_2609(2609, "数据源连接失败，错误信息[%s]"),
  ERROR_2610(2610, "数据源连接失败，请检查数据源连通性是否正常"),
  //  // quality-coordinator
  ERROR_2200(2200, "xxx"),

  // quality-template
  ERROR_2300(2300, "xxx"),

  // quality-plan
  ERROR_2400(2400, "xxx"),

  //engine & storage
  ERROR_3100(3100, "引擎操作失败，操作类型[%s]，错误信息[%s]"),
  ERROR_3101(3101, "[%s]引擎[%s]操作失败，操作类型[%s]，错误信息[%s]"),
  ERROR_3201(3201, "存储[%s]操作失败，操作类型[%s]，错误信息[%s]"),

  ERROR_8000(8000, "依赖任务运行失败 原因："
      + "被依赖任务在依赖任务启动后的2分钟内没有生成job任务，超过2分钟的时间容忍度"),
  ERROR_8001(8001, "依赖任务运行失败 原因：被依赖任务运行失败，则当前任务运行失败"),
  ERROR_8002(8002, "依赖任务运行时间超过指定的超时时间[%s]"),

  ERROR_8100(8100, "标签值[%s]配置的加工逻辑语法有误，请修改后重试"),
  ERROR_8101(8101, "数据表主键字段类型只能是bigint或者string"),
  ERROR_8102(8102, "标签值[%s]没有指定加工逻辑，请填写完整后重试"),
  ERROR_8103(8103, "标签引用的数据表主键已经被指定过不可更改"),
  ERROR_8104(8104, "逻辑实体[%s]已被物理实体关联,无法删除"),
  ERROR_8105(8105, "逻辑实体[%s]已被物理实体关联,无法修改"),
  ERROR_8106(8106, "不能更换逻辑实体对应的逻辑模型id"),
  ERROR_8107(8107, "逻辑模型[%s]存在逻辑实体,无法删除"),
  ERROR_8108(8108, "实体[%s]不属于模型[%s]"),
  ERROR_8109(8109, "已被[%s]物理实体引用，请先删除物理实体"),


  ERROR_9999(9999, "内部错误，请联系管理员");

  private int code;

  private String message;

  MessageCode(int code, String message) {
    this.code = code;
    this.message = message;
  }

  @Override
  public int getCode() {
    return code;
  }

  public void setCode(int code) {
    this.code = code;
  }

  @Override
  public String getMessage() {
    return message;
  }

  public void setMessage(String message) {
    this.message = message;
  }
}
